InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенПродажи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры/Ext/ManagerModule.bsl
Процедура ЗаполнитьЦены(ДанныеТаблицы,Период,ВидЦены) Экспорт
	
	Для Каждого Строка Из ДанныеТаблицы Цикл
		ЗаписьНоменклатуры = СоздатьМенеджерЗаписи();
		ЗаписьНоменклатуры.Период = Период;
		ЗаписьНоменклатуры.Номенклатура = Строка.Номенклатура;
		ЗаписьНоменклатуры.ВидЦены = ВидЦены;
		ЗаписьНоменклатуры.Цена = Строка.Цена;
		ЗаписьНоменклатуры.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры
